`timescale 1ns / 1ps
`default_nettype none

//-----------------------------------------------------------------------------
//
//   en   sel     y
//   ---------------------
//    0   xxx     00000000     
//    1   000     00000001
//    1   001     00000010
//    1   010     00000100
//    1   011     00001000
//    1   100     00010000
//    1   101     00100000
//    1   110     01000000
//    1   111     10000000
//-----------------------------------------------------------------------------
module decoder3to8 (
    input  wire [2:0] sel,
    input  wire       en,
    output reg  [7:0] y      // reg כי נשים ערך בתוך always. זה עדיין לוגיקה
                             // קומבינטורית! "reg" בוורילוג לא אומר פליפ-פלופ.
);

    // ------------------------------------------------------------------
    // TODO 1 - גרסה עם always @(*) ו-case
    //
    always @(*) begin
        if (!en)
             y = 8'b0000_0000;
        else
            case (sel)
                3'd0: y = 8'b0000_0001;
                3'd1: y = 8'b0000_0010;
                3'd2: y = 8'b0000_0100;
                3'd3: y = 8'b0000_1000;
                3'd4: y = 8'b0001_0000;
                3'd5: y = 8'b0010_0000;
                3'd6: y = 8'b0100_0000;
                3'd7: y = 8'b1000_0000;
                default: y = 8'b0000_0000;
            endcase
    end




    // ------------------------------------------------------------------
    // TODO 2 (בונוס, 2 דקות) - אחרי שהגרסה למעלה עוברת, נסה לכתוב את
    // אותו הדבר בשורה אחת בעזרת אופרטור ההזזה:
    //
    //     assign y = en ? (8'b1 << sel) : 8'b0;
    //
    // (תצטרך לשנות את y ל-wire). שים לב שזה בדיוק אותה חומרה.
    // תובנה טובה לראיון: "decoder הוא shift של 1 בכמות המקודדת".
    // ------------------------------------------------------------------

endmodule

`default_nettype wire
